<b> LAB Assignment 3 Student Name: Neha Pawar Student ID: 1286279 </b>

Claim : Financial Markets do punish security breaches.

https://public.tableau.com/profile/neha4079#!/vizhome/LAB3_attempt1/LAB3?publish=yes

PFB Data wrangling steps:

In [ ]:
import pandas as pd
import json
import requests
import urllib
import datetime as dt
import pandas_datareader as pdr

In [92]:
#coverting a csv file into a dataframe
databreach_2017 = pd.read_csv('databreach_2017.csv')

In [110]:
del databreach_2017['Unnamed: 0']

In [111]:
databreach_2017.head()

,ENTITY,YEAR,RECORDS LOST,ORGANISATION,METHOD OF LEAK,DATA SENSITIVITY
0,AOL,2004,92000000,web,inside job,Just email address/Online information
1,Automatic Data Processing,2005,125000,financial,poor security,SSN/Personal details
2,Ameritrade Inc.,2005,200000,financial,lost / stolen device,SSN/Personal details
3,Citigroup,2005,3900000,financial,lost / stolen device,Credit card information
4,Cardsystems Solutions Inc.,2005,40000000,financial,hacked,Credit card information

In [ ]:
databreach_2017.to_csv('databreach_2017.csv')

Collecting ticker value for the given Entites:

In [ ]:
def get_symbol(name):
    url = "http://d.yimg.com/autoc.finance.yahoo.com/autoc?query={}&region=1&lang=en".format(name)

    result = requests.get(url).json()
    
    for x in result['ResultSet']['Result']:
        #if x['name'] == name :
            #if (x['exchDisp']=='NYSE'or x['exchDisp']=='NASDAQ'):
                #if x['typeDisp']=='Equity':
                    return x['symbol']
        
##company = get_symbol("twitter")
##print(company)
ticker=[]
company = databreach_2017.ENTITY
##for  xyz in cmp_name:
    ##ticker = get_symbol(xyz)
    ##print(ticker)
    
for  tkr in company:
    ticker.append(get_symbol(tkr))

In [131]:
#created ticker dataframe (to add column 'ticker' to databreach_2017 dataframe)
orig_ticker = pd.DataFrame(ticker) 
orig_ticker['Ticker_Symbol'] = pd.Series(ticker, index=data_ticker.index)

In [132]:
databreach_2017['Ticker_symbol']= data_ticker['Ticker_Symbol']

In [133]:
#Drop empty columns(axis=1 for columns and axis=0 for rows; 
#how='all' to drop if all values are nan and how='any' to drop if any value is nan)
databreach_2017 = databreach_2017.dropna(axis=0,how='any')

In [134]:
databreach_2017.head()

,ENTITY,YEAR,RECORDS LOST,ORGANISATION,METHOD OF LEAK,DATA SENSITIVITY,Ticker_symbol
0,AOL,2004,92000000,web,inside job,Just email address/Online information,AOL-U.TI
1,Automatic Data Processing,2005,125000,financial,poor security,SSN/Personal details,ADP
3,Citigroup,2005,3900000,financial,lost / stolen device,Credit card information,CIT-U.TI
5,Hewlett Packard,2006,200000,"tech, retail",lost / stolen device,SSN/Personal details,HPQ
7,KDDI,2006,4000000,telecoms,hacked,Just email address/Online information,KDDIY

In [135]:
databreach_2017.to_csv('LAB3_ticker.csv')

In [97]:
#getting stock price data for the available ticker's data
start = dt.datetime(2004,1,1)
end = dt.datetime(2017,6,6)
data_source = 'yahoo'
tickerdata = pdr.DataReader(ticker, data_source, start, end)

/anaconda/lib/python2.7/site-packages/pandas_datareader/yahoo/daily.py:136: SymbolWarning: Failed to read symbol: u'SAND-P.V', replacing with NaN.
  warnings.warn(msg.format(sym), SymbolWarning)

In [98]:
tickerdata

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 3567 (major_axis) x 63 (minor_axis)
Items axis: Adj Close to Volume
Major_axis axis: 2004-01-01 00:00:00 to 2017-06-07 00:00:00
Minor_axis axis: None to ^UMIAMIFL

Covert Tickerdata into a dataframe:

In [99]:
tickerdata = tickerdata.ix['Close']

/anaconda/lib/python2.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [100]:
all_weekdays = pd.date_range(start=start, end=end, freq='B')

In [101]:
tickerdata = tickerdata.reindex(all_weekdays)

In [102]:
tickerdata.head(5)

,None,0303.HK,035080.KQ,1880.HK,2GF.F,AABA,AAPL,ADBE,ADP,AMTD,...,TALK.L,TGT,TWTR,UBI.PA,UPS,VKTX,VOD,YAHOY,^CEX,^UMIAMIFL
2004-01-01,NaN,11.05,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,5.5900,NaN,NaN,NaN,NaN,NaN,NaN
2004-01-02,NaN,11.00,2543.219971,NaN,NaN,22.700001,1.520000,19.549999,31.690842,14.15,...,NaN,37.720001,NaN,5.6125,73.650002,NaN,29.485947,NaN,197.270004,NaN
2004-01-05,NaN,11.60,2713.330078,NaN,NaN,23.450001,1.583571,19.900000,32.626656,14.88,...,NaN,37.400002,NaN,5.8125,73.930000,NaN,30.650940,NaN,200.089996,NaN
2004-01-06,NaN,11.55,2721.840088,NaN,NaN,23.620001,1.577857,19.920000,32.935951,15.00,...,NaN,38.570000,NaN,5.6775,73.480003,NaN,31.116936,NaN,198.300003,NaN
2004-01-07,NaN,11.70,2768.620117,NaN,NaN,23.834999,1.613571,19.719999,32.761478,15.14,...,NaN,38.270000,NaN,5.6975,73.239998,NaN,31.000437,NaN,197.759995,NaN

In [103]:
tickerdata = tickerdata.dropna(axis=1,how='all')

In [104]:
tickerdata.head(5)

,0303.HK,035080.KQ,2GF.F,AABA,AAPL,ADBE,ADP,AMTD,ANTM,AT,...,SPLS,TALK.L,TGT,TWTR,UBI.PA,UPS,VKTX,VOD,YAHOY,^CEX
2004-01-01,11.05,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,5.5900,NaN,NaN,NaN,NaN,NaN
2004-01-02,11.00,2543.219971,NaN,22.700001,1.520000,19.549999,31.690842,14.15,38.139999,NaN,...,17.500000,NaN,37.720001,NaN,5.6125,73.650002,NaN,29.485947,NaN,197.270004
2004-01-05,11.60,2713.330078,NaN,23.450001,1.583571,19.900000,32.626656,14.88,36.855000,NaN,...,17.507000,NaN,37.400002,NaN,5.8125,73.930000,NaN,30.650940,NaN,200.089996
2004-01-06,11.55,2721.840088,NaN,23.620001,1.577857,19.920000,32.935951,15.00,37.055000,NaN,...,17.372999,NaN,38.570000,NaN,5.6775,73.480003,NaN,31.116936,NaN,198.300003
2004-01-07,11.70,2768.620117,NaN,23.834999,1.613571,19.719999,32.761478,15.14,37.250000,NaN,...,17.920000,NaN,38.270000,NaN,5.6975,73.239998,NaN,31.000437,NaN,197.759995

In [112]:
avg_data = tickerdata.groupby(pd.TimeGrouper(freq='12M')).mean()

In [113]:
avg_data.head()

,0303.HK,035080.KQ,2GF.F,AABA,AAPL,ADBE,ADP,AMTD,ANTM,AT,...,SPLS,TALK.L,TGT,TWTR,UBI.PA,UPS,VKTX,VOD,YAHOY,^CEX
2004-01-31,11.956818,2758.696682,NaN,23.770250,1.628678,19.025500,32.813820,15.622000,38.528499,NaN,...,17.421300,NaN,38.162000,NaN,5.517955,72.591500,NaN,31.031309,NaN,194.836001
2005-01-31,13.152299,2051.893008,NaN,30.758254,2.800831,23.892837,34.064935,12.953095,45.859802,NaN,...,19.206939,NaN,45.924206,NaN,4.835096,74.770833,NaN,28.588626,NaN,202.757976
2006-01-31,19.583469,4614.145226,NaN,35.605357,7.157752,31.566151,35.050695,17.794405,70.039623,NaN,...,21.836479,NaN,53.296627,NaN,9.529148,73.008691,NaN,29.382577,NaN,225.389841
2007-01-31,38.933400,7148.666972,NaN,29.151554,10.241833,35.627809,36.863325,17.797131,75.366893,NaN,...,24.889084,NaN,53.445179,NaN,10.626167,76.269841,NaN,25.398224,NaN,236.457410
2008-01-31,59.039634,5795.079755,NaN,27.017421,19.153662,41.782699,40.408635,18.087817,81.085000,NaN,...,24.129445,NaN,60.269524,NaN,22.347837,72.929643,NaN,33.282122,NaN,290.555873

In [114]:
final_ticker_data = avg_data.T

In [117]:
final_ticker_data.head(2)

,2004-01-31 00:00:00,2005-01-31 00:00:00,2006-01-31 00:00:00,2007-01-31 00:00:00,2008-01-31 00:00:00,2009-01-31 00:00:00,2010-01-31 00:00:00,2011-01-31 00:00:00,2012-01-31 00:00:00,2013-01-31 00:00:00,2014-01-31 00:00:00,2015-01-31 00:00:00,2016-01-31 00:00:00,2017-01-31 00:00:00,2018-01-31 00:00:00
0303.HK,11.956818,13.152299,19.583469,38.933400,59.039634,38.519918,54.180478,83.305400,84.078189,90.429,105.294262,100.252632,96.951220,89.317073,98.114881
035080.KQ,2758.696682,2051.893008,4614.145226,7148.666972,5795.079755,4404.571429,6234.212598,5103.869048,5319.190283,6211.400,9145.510204,11107.398374,10496.048387,6609.085366,5116.726190

In [126]:
#created a dataframe for de-normalized data about Ticker symbol, date and corresponding stock price
tickerdf = pd.DataFrame(columns=['Symbol','Date','Price'])
d =0
for i in range(len(final_ticker_data)) : 
    ts = final_ticker_data.index[i]
    for j in range(len(final_ticker_data.iloc[i])): 
        timet = pd.to_datetime(str(final_ticker_data.columns.values[j]))
        date = timet.strftime('%Y-%m-%d')
        tickerdf.loc[d]=( ts,  date , final_ticker_data.iloc[i][j])
        d=d+1

In [127]:
tickerdf.head()

    Symbol        Date      Price
0  0303.HK  2004-01-31  11.956818
1  0303.HK  2005-01-31  13.152299
2  0303.HK  2006-01-31  19.583469
3  0303.HK  2007-01-31  38.933400
4  0303.HK  2008-01-31  59.039634

In [128]:
#Removing rows with null values
tickerdf = tickerdf.dropna(axis=0,how='any')

In [130]:
tickerdf.to_csv('ticker_data_LAB3.csv')